doc/AddressBook1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-17 Sun 13:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>First sketch of an Alloy model in FOL</title>
<meta name="author" content="CMSMcQ" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">First sketch of an Alloy model in FOL</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0c37d5e">1. The Alloy model</a></li>
<li><a href="#org125d75c">2. The FOPC translation</a></li>
</ul>
</div>
</div>
<p>
This document provides a first sketch of what an Alloy model might
look like if re-expressed in standard first-order predicate calculus.
It is intended to explore the space a little bit and learn more about
what might be involved.
</p>

<p>
We start by reproducing the model; it's the first example in Jackson's
"Whirlwind tour" of Alloy, so it's not very complicated (but
complicated enough for our purposes). We then work through the
translation. 
</p>

<div id="outline-container-org0c37d5e" class="outline-2">
<h2 id="org0c37d5e"><span class="section-number-2">1.</span> The Alloy model</h2>
<div class="outline-text-2" id="text-1">
<p>
The model appears on p. 6 of Jackson 2012:
</p>
<div class="org-src-container">
<pre class="src src-alloy">module tour/addressBook1

sig Name, Addr {}
sig Book {
    addr:  Name -&gt; lone Addr
}  
</pre>
</div>

<p>
Readers familiar with Alloy will find this straightforward to read;
for those unfamiliar with Alloy, it may be paraphrased very briefly as
saying that names (atoms of class <i>Name</i>), addresses (<i>Addr</i>), and
books (<i>Book</i>) exist (or: may exist), and that books have a property
named <i>addr</i>, which maps names to addresses, with the constraint that
any given name maps to at most one address.
</p>

<p>
A fuller and more careful account is given in the next section.
</p>
</div>
</div>

<div id="outline-container-org125d75c" class="outline-2">
<h2 id="org125d75c"><span class="section-number-2">2.</span> The FOPC translation</h2>
<div class="outline-text-2" id="text-2">
<p>
First, we enunciate the entailments of the three signature
declarations for Name, Addr, and Book.
</p>

<p>
First of all, signatures define classes or sets of atoms.  So we say:
</p>

<p>
In the universe of discourse, a thing can be a Name, an Addr, a Book,
or an individual automatically supplied by the system.  (In Alloy, the
<i>Int</i> signature is typically present whether declared or not.)
</p>

<p>
We represent the set of all <i>Name</i> atoms using the predicate <i>Name</i>,
and more generally we take every signature name to be a predicate
(true for members of the signature, false for others).  We assume a
predicate <i>AUTO</i> for all individuals automatically supplied by the
system. (It should perhaps be <i>Int</i>, but until I'm clearer on what
can be automatically included, I'll stick with <i>AUTO</i>.)
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all x)(Name(x) or Addr(x) or Book(x) or AUTO(x))
</pre>
</div>

<p>
Second, top-level signatures are pairwise disjoint.
</p>

<div class="org-src-container">
<pre class="src src-fopc">not(exists x)(Name(x) and Addr(x))
not(exists x)(Name(x) and Book(x))
not(exists x)(Name(x) and AUTO(x))
not(exists x)(Addr(x) and Book(x))
not(exists x)(Addr(x) and AUTO(x))
not(exists x)(Book(x) and AUTO(x))
</pre>
</div>

<p>
Note that these formulas also serve to show the reader that the
predicates <i>Name</i>, <i>Addr</i>, and <i>Book</i> are understood as being defined.
</p>

<p>
We could also write this differently, as:
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all x : Name)(not(Addr(x)) and not(Book(x)) and not(AUTO(x)))
(all x : Addr)(not(Name(x)) and not(Book(x)) and not(AUTO(x)))
(all x : Book)(not(Name(x)) and not(Addr(x)) and not(AUTO(x)))
(all x : AUTO)(not(Name(x)) and not(Addr(x)) and not(Book(x)))
</pre>
</div>

<p>
with one formula for each top-level signature, each naming all the
other top-level signatures. 
</p>

<p>
The declaration of <i>Book</i> specifies that books contain a mapping from
<i>Name</i> to <i>Addr</i>.  The mapping is not assumed complete over all names:
the declaration "<code>addr: Name -&gt; lone Addr</code>" does specify with the
keyword <i>lone</i> that any given name maps to at most one address.  (The
keyword <i>lone</i> means one, or none &#x2013; Less than one, or ONE, in the
mnemonic formulation.)
</p>

<p>
The type information can be captured by a generalization over all
tuples in the relation:
</p>
<div class="org-src-container">
<pre class="src src-fopc">(all x, y, z)(address(x, y, z) 
             implies
             (Book(x) and Name(y) and Addr(z)))
</pre>
</div>

<p>
The fact that no name maps to more than one address can be expressed
by saying that for any book <i>x</i> and name <i>y</i>, there are not two
addresses <i>y</i> and <i>z</i> such that <i>address(x, y, z)</i> and <i>address(x, y,
w)</i>.  Using our usual short-hands, this is
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all x : Book)(all y : Name)
(not (some z, w: Addr)
     (address(x, y, z)
     and address(x, y, w)
     and z ≠ w))
</pre>
</div>

<p>
To get this into the target language, those typed quantifications must
be rewritten:
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all x)(Book(x) implies
    (all y)(Name(y) implies
        (not (exists z)
             (Addr(z)
             and (exists w)
                 (Addr(w)
                 and address(x, y, z)
                 and address(x, y, w)
                 and z ≠ w))))
</pre>
</div>

<p>
Or, moving the quantifiers outward and rewriting to a formulation that
seems simpler:
</p>

<div class="org-src-container">
<pre class="src src-fopc">(all x)(all y)
    ((Book(x) and Book(y))
     implies
     (not (exists z)
          (exists w)
          (Addr(z) and Addr(w)
           and address(x, y, z)
           and address(x, y, w)
           and z ≠ w)))
</pre>
</div>

<p>
At this point, I would really like to have a Begriffsschrift-style
parse tree for the expression. Failing that, we can use indentation
and nested lists to show the parse tree and with it the scope of
declarations:
</p>

<ul class="org-ul">
<li>(all x)(all y)
<ul class="org-ul">
<li>implies
<ul class="org-ul">
<li>and
<ul class="org-ul">
<li>Book(x)</li>
<li>Book(x)</li>
</ul></li>
<li>not
<ul class="org-ul">
<li>(exists y)(exists w)
<ul class="org-ul">
<li>and
<ul class="org-ul">
<li>Addr(y)</li>
<li>Addr(w)</li>
<li>address(x, y, z)</li>
<li>address(x, y, w)</li>
<li>z ≠ w</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 17 March 2024</p>
<p class="author">Author: CMSMcQ</p>
<p class="date">Created: 2024-03-17 Sun 13:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
